# ScaledDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoofComponents..::..ScaledDepth Property
RoofComponents Class See Also
---
The depth of the roof slab.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double ScaledDepth { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ScaledDepth As Double
	Get
```

Visual C++
---
```text
public:
property double ScaledDepth {
	double get ();
}
```

# See Also
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace